000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ALG01.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600
000700 PROCEDURE DIVISION.
000800     DISPLAY 'Bom dia'.
000900     STOP RUN.
