000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ALG09.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 77 X PIC 9(10).
000700 77 Y PIC Z(10).
000800
000900 PROCEDURE DIVISION.
001000     ACCEPT X.
001100     IF (X >= 10)
001200         COMPUTE Y = X ** 2
001300     ELSE
001400         COMPUTE Y = X ** 3.
001500     DISPLAY Y.
001600     STOP RUN.
