000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ALG07.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 77 X PIC 9(10).
000700 77 Y PIC 9(10).
000800 77 Z PIC Z(10).
000900
001000 PROCEDURE DIVISION.
001100     ACCEPT X.
001200     ACCEPT Y.
001300     IF (X > 100)
001400         COMPUTE Z = X + Y.
001500         DISPLAY Z.
001600     STOP RUN.
