000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ALG02.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 77 X PIC 9(10).
000700 77 Y PIC Z(10).
000800
000900 PROCEDURE DIVISION.
001000     ACCEPT X.
001100     COMPUTE Y = X ** 2.
001200     DISPLAY Y.
001300     STOP RUN.
