000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ALG08.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 77 X PIC 9(10).
000700 77 Y PIC 9(10).
000800 77 S PIC Z(10).
000900
001000 PROCEDURE DIVISION.
001100     ACCEPT X.
001200     ACCEPT Y.
001300     IF (X <= Y)
001400         MOVE X TO S
001500     ELSE
001600         MOVE Y TO S.
001700     DISPLAY S.
001800     STOP RUN.
