000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ALG06.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 77 X PIC 9(10).
000700 77 S PIC Z(10).
000800
000900 PROCEDURE DIVISION.
001000     ACCEPT X.
001100     IF (X > 100)
001200         MOVE X TO S.
001300         DISPLAY S.
001400     STOP RUN.
