000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ALG10.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 77  X PIC 9(10).
000700 77  Y PIC 9(10).
000800 77 N1 PIC Z(10).
000900 77 N2 PIC Z(10).
001000
001100 PROCEDURE DIVISION.
001200     ACCEPT X.
001300     ACCEPT Y.
001400     IF (X > Y)
001500         MOVE Y TO N1
001600         MOVE X TO N2
001700     ELSE
001800         MOVE X TO N1
001900         MOVE Y TO N2.
002000     DISPLAY N1.
002100     DISPLAY N2.
002200     STOP RUN.
