000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ALG11.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 77 X PIC 9(10).
000700 77 I PIC 9(10).
000800 77 S PIC Z(02).
000900
001000 PROCEDURE DIVISION.
001100     MOVE 0 TO X.
001200     MOVE 1 TO I.
001300     PERFORM UNTIL NOT (I <= 10)
001400         MOVE X TO S      
001500         DISPLAY S
001600         COMPUTE X = X + 2
001700         COMPUTE I = I + 1
001800     END-PERFORM.
001900     STOP RUN.
